tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "xz"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "grpc"
brew "apache-arrow"
brew "autoconf"
brew "coreutils"
brew "asdf"
brew "boost"
brew "glib"
brew "cgal"
brew "fwup"
brew "gcc"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gpgme"
brew "pkgconf"
brew "hdf5"
brew "proj"
brew "libheif"
brew "libpq"
brew "netcdf"
brew "numpy"
brew "poppler"
brew "gdal"
brew "ghostscript"
brew "git"
brew "imagemagick"
brew "luarocks"
brew "mosquitto"
brew "neovim"
brew "node"
brew "sfcgal"
brew "postgis"
brew "postgresql@14", restart_service: :changed
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "squashfs"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wxwidgets"
brew "yarn"
brew "zellij"
brew "zsh-syntax-highlighting"
cask "chromedriver"
cask "cmake"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "ghostty"
cask "rar"
vscode "amin.omodoro"
vscode "anseki.vscode-color"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "darkriszty.markdown-table-prettify"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-terminal"
vscode "geyao.html-snippets"
vscode "henoc.svgeditor"
vscode "jakebecker.elixir-ls"
vscode "jamilabreu.vscode-phoenix-snippets"
vscode "jgclark.vscode-todo-highlight"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "jsynowiec.vscode-insertdatestring"
vscode "macieklad.tailwind-sass-syntax"
vscode "mjmcloug.vscode-elixir"
vscode "mrorz.language-gettext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "nextfaze.json-parse-stringify"
vscode "phoenixframework.phoenix"
vscode "qcz.text-power-tools"
vscode "royalmist.vscode-eex-format"
vscode "ryu1kn.partial-diff"
vscode "siris01.catppuccin-theme"
vscode "theumletteam.umlet"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "wayou.vscode-todo-highlight"
vscode "whatwewant.open-terminal"
vscode "yzhang.markdown-all-in-one"
vscode "znck.grammarly"
